import { CarDetailInfo } from '../DetailInfoPage';
import React from 'react';

export const ToyotaCamry: CarDetailInfo = {
  name: 'Toyota Camry 2.0 AT Стандарт 2020',
  bodyLength: 4400,
  bodyWidth: 1740,
  bodyHeight: 1470,
  wheelbase: 2560,
  clearance: 160,
  details: [
    {
      name: 'Двигатель',
      params: [
        {
          name: 'Рабочий объем',
          value: '1368 см3',
        },
        {
          name: 'Диаметр цилиндра / Ход поршня',
          value: '72.0 / 84.0 мм',
        },
        {
          name: 'Степень сжатия',
          value: '10.5',
        },
        {
          name: 'Максимальная мощность',
          value: '100 л.с. (73.3 кВт) при 6000 об/мин',
        },
        {
          name: 'Максимальный крутящий момент',
          value: '132 Н*м при 4000 об/мин',
        },
      ],
    },
    {
      name: 'Двигатель',
      params: [
        {
          name: 'Рабочий объем',
          value: '1368 см3',
        },
        {
          name: 'Диаметр цилиндра / Ход поршня',
          value: '72.0 / 84.0 мм',
        },
        {
          name: 'Степень сжатия',
          value: '10.5',
        },
        {
          name: 'Максимальная мощность',
          value: '100 л.с. (73.3 кВт) при 6000 об/мин',
        },
        {
          name: 'Максимальный крутящий момент',
          value: '132 Н*м при 4000 об/мин',
        },
      ],
    },
    {
      name: 'Двигатель',
      params: [
        {
          name: 'Рабочий объем',
          value: '1368 см3',
        },
        {
          name: 'Диаметр цилиндра / Ход поршня',
          value: '72.0 / 84.0 мм',
        },
        {
          name: 'Степень сжатия',
          value: '10.5',
        },
        {
          name: 'Максимальная мощность',
          value: '100 л.с. (73.3 кВт) при 6000 об/мин',
        },
        {
          name: 'Максимальный крутящий момент',
          value: '132 Н*м при 4000 об/мин',
        },
      ],
    },
  ],
};
